apache/nuttx/arch/arm/src/s32k1xx/hardware/s32k1xx_port.h
/****************************************************************************************************
 * arch/arm/src/s32k1xx/chip/s32k1xx_port.h
 *
 *   Copyright (C) 2019 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************************************/

#ifndef __ARCH_ARM_SRC_S32K1XX_HARDWARE_S32K1XX_PORT_H
#define __ARCH_ARM_SRC_S32K1XX_HARDWARE_S32K1XX_PORT_H

/****************************************************************************************************
 * Included Files
 ****************************************************************************************************/

#include <nuttx/config.h>
#include <hardware/s32k1xx_memorymap.h>

/****************************************************************************************************
 * Pre-processor Definitions
 ****************************************************************************************************/

#define S32K1XX_PORTA               0
#define S32K1XX_PORTB               1
#define S32K1XX_PORTC               2
#define S32K1XX_PORTD               3
#define S32K1XX_PORTE               4
#define S32K1XX_NPORTS              5

/* PORT Register Offsets ****************************************************************************/

#define S32K1XX_PORT_PCR_OFFSET(n)  (0 + ((n) << 2) /* Pin Control Register n=0..31 */
#define S32K1XX_PORT_GPCLR_OFFSET   0x0080  /* Global Pin Control Low Register */
#define S32K1XX_PORT_GPCHR_OFFSET   0x0084  /* Global Pin Control High Register */
#define S32K1XX_PORT_GICLR_OFFSET   0x0088  /* Global Interrupt Control Low Register */
#define S32K1XX_PORT_GICHR_OFFSET   0x008c  /* Global Interrupt Control High Register */
#define S32K1XX_PORT_ISFR_OFFSET    0x00a0  /* Interrupt Status Flag Register */
#define S32K1XX_PORT_DFER_OFFSET    0x00c0  /* Digital Filter Enable Register */
#define S32K1XX_PORT_DFCR_OFFSET    0x00c4  /* Digital Filter Clock Register */
#define S32K1XX_PORT_DFWR_OFFSET    0x00c8  /* Digital Filter Width Register */

/* PORT Register Addresses **************************************************************************/

#define S32K1XX_PORT_BASE(p)        (S32K1XX_PORTA_BASE + ((p) << 2)

#define S32K1XX_PORT_PCR_BASE(p,n)  (S32K1XX_PORT_BASE(p) + S32K1XX_PORT_PCR_OFFSET(n))
#define S32K1XX_PORT_GPCLR(p)       (S32K1XX_PORT_BASE(p) + S32K1XX_PORT_GPCLR_OFFSET)
#define S32K1XX_PORT_GPCHR(p)       (S32K1XX_PORT_BASE(p) + S32K1XX_PORT_GPCHR_OFFSET)
#define S32K1XX_PORT_GICLR(p)       (S32K1XX_PORT_BASE(p) + S32K1XX_PORT_GICLR_OFFSET)
#define S32K1XX_PORT_GICHR(p)       (S32K1XX_PORT_BASE(p) + S32K1XX_PORT_GICHR_OFFSET)
#define S32K1XX_PORT_ISFR(p)        (S32K1XX_PORT_BASE(p) + S32K1XX_PORT_ISFR_OFFSET)
#define S32K1XX_PORT_DFER(p)        (S32K1XX_PORT_BASE(p) + S32K1XX_PORT_DFER_OFFSET)
#define S32K1XX_PORT_DFCR(p)        (S32K1XX_PORT_BASE(p) + S32K1XX_PORT_DFCR_OFFSET)
#define S32K1XX_PORT_DFWR(p)        (S32K1XX_PORT_BASE(p) + S32K1XX_PORT_DFWR_OFFSET)

#define S32K1XX_PORTA_PCR_BASE(n)   (S32K1XX_PORTA_BASE + S32K1XX_PORT_PCR_OFFSET(n))
#define S32K1XX_PORTA_GPCLR         (S32K1XX_PORTA_BASE + S32K1XX_PORT_GPCLR_OFFSET)
#define S32K1XX_PORTA_GPCHR         (S32K1XX_PORTA_BASE + S32K1XX_PORT_GPCHR_OFFSET)
#define S32K1XX_PORTA_GICLR         (S32K1XX_PORTA_BASE + S32K1XX_PORT_GICLR_OFFSET)
#define S32K1XX_PORTA_GICHR         (S32K1XX_PORTA_BASE + S32K1XX_PORT_GICHR_OFFSET)
#define S32K1XX_PORTA_ISFR          (S32K1XX_PORTA_BASE + S32K1XX_PORT_ISFR_OFFSET)
#define S32K1XX_PORTA_DFER          (S32K1XX_PORTA_BASE + S32K1XX_PORT_DFER_OFFSET)
#define S32K1XX_PORTA_DFCR          (S32K1XX_PORTA_BASE + S32K1XX_PORT_DFCR_OFFSET)
#define S32K1XX_PORTA_DFWR          (S32K1XX_PORTA_BASE + S32K1XX_PORT_DFWR_OFFSET)

#define S32K1XX_PORTB_PCR_BASE(n)   (S32K1XX_PORTB_BASE + S32K1XX_PORT_PCR_OFFSET(n))
#define S32K1XX_PORTB_GPCLR         (S32K1XX_PORTB_BASE + S32K1XX_PORT_GPCLR_OFFSET)
#define S32K1XX_PORTB_GPCHR         (S32K1XX_PORTB_BASE + S32K1XX_PORT_GPCHR_OFFSET)
#define S32K1XX_PORTB_GICLR         (S32K1XX_PORTB_BASE + S32K1XX_PORT_GICLR_OFFSET)
#define S32K1XX_PORTB_GICHR         (S32K1XX_PORTB_BASE + S32K1XX_PORT_GICHR_OFFSET)
#define S32K1XX_PORTB_ISFR          (S32K1XX_PORTB_BASE + S32K1XX_PORT_ISFR_OFFSET)
#define S32K1XX_PORTB_DFER          (S32K1XX_PORTB_BASE + S32K1XX_PORT_DFER_OFFSET)
#define S32K1XX_PORTB_DFCR          (S32K1XX_PORTB_BASE + S32K1XX_PORT_DFCR_OFFSET)
#define S32K1XX_PORTB_DFWR          (S32K1XX_PORTB_BASE + S32K1XX_PORT_DFWR_OFFSET)

#define S32K1XX_PORTC_PCR_BASE(n)   (S32K1XX_PORTC_BASE + S32K1XX_PORT_PCR_OFFSET(n))
#define S32K1XX_PORTC_GPCLR         (S32K1XX_PORTC_BASE + S32K1XX_PORT_GPCLR_OFFSET)
#define S32K1XX_PORTC_GPCHR         (S32K1XX_PORTC_BASE + S32K1XX_PORT_GPCHR_OFFSET)
#define S32K1XX_PORTC_GICLR         (S32K1XX_PORTC_BASE + S32K1XX_PORT_GICLR_OFFSET)
#define S32K1XX_PORTC_GICHR         (S32K1XX_PORTC_BASE + S32K1XX_PORT_GICHR_OFFSET)
#define S32K1XX_PORTC_ISFR          (S32K1XX_PORTC_BASE + S32K1XX_PORT_ISFR_OFFSET)
#define S32K1XX_PORTC_DFER          (S32K1XX_PORTC_BASE + S32K1XX_PORT_DFER_OFFSET)
#define S32K1XX_PORTC_DFCR          (S32K1XX_PORTC_BASE + S32K1XX_PORT_DFCR_OFFSET)
#define S32K1XX_PORTC_DFWR          (S32K1XX_PORTC_BASE + S32K1XX_PORT_DFWR_OFFSET)

#define S32K1XX_PORTD_PCR_BASE(n)   (S32K1XX_PORTD_BASE + S32K1XX_PORT_PCR_OFFSET(n))
#define S32K1XX_PORTD_GPCLR         (S32K1XX_PORTD_BASE + S32K1XX_PORT_GPCLR_OFFSET)
#define S32K1XX_PORTD_GPCHR         (S32K1XX_PORTD_BASE + S32K1XX_PORT_GPCHR_OFFSET)
#define S32K1XX_PORTD_GICLR         (S32K1XX_PORTD_BASE + S32K1XX_PORT_GICLR_OFFSET)
#define S32K1XX_PORTD_GICHR         (S32K1XX_PORTD_BASE + S32K1XX_PORT_GICHR_OFFSET)
#define S32K1XX_PORTD_ISFR          (S32K1XX_PORTD_BASE + S32K1XX_PORT_ISFR_OFFSET)
#define S32K1XX_PORTD_DFER          (S32K1XX_PORTD_BASE + S32K1XX_PORT_DFER_OFFSET)
#define S32K1XX_PORTD_DFCR          (S32K1XX_PORTD_BASE + S32K1XX_PORT_DFCR_OFFSET)
#define S32K1XX_PORTD_DFWR          (S32K1XX_PORTD_BASE + S32K1XX_PORT_DFWR_OFFSET)

#define S32K1XX_PORTE_PCR_BASE(n)   (S32K1XX_PORTE_BASE + S32K1XX_PORT_PCR_OFFSET(n))
#define S32K1XX_PORTE_GPCLR         (S32K1XX_PORTE_BASE + S32K1XX_PORT_GPCLR_OFFSET)
#define S32K1XX_PORTE_GPCHR         (S32K1XX_PORTE_BASE + S32K1XX_PORT_GPCHR_OFFSET)
#define S32K1XX_PORTE_GICLR         (S32K1XX_PORTE_BASE + S32K1XX_PORT_GICLR_OFFSET)
#define S32K1XX_PORTE_GICHR         (S32K1XX_PORTE_BASE + S32K1XX_PORT_GICHR_OFFSET)
#define S32K1XX_PORTE_ISFR          (S32K1XX_PORTE_BASE + S32K1XX_PORT_ISFR_OFFSET)
#define S32K1XX_PORTE_DFER          (S32K1XX_PORTE_BASE + S32K1XX_PORT_DFER_OFFSET)
#define S32K1XX_PORTE_DFCR          (S32K1XX_PORTE_BASE + S32K1XX_PORT_DFCR_OFFSET)
#define S32K1XX_PORTE_DFWR          (S32K1XX_PORTE_BASE + S32K1XX_PORT_DFWR_OFFSET)

/* PORT Register Bitfield Definitions ***************************************************************/

/* Pin Control Register n=0..31 */

#define PORT_PCR_PS                 (1 << 0)  /* Bit 0:  Pull Select */
#  define PORT_PCR_PULLDOWN         (0)       /*         Enable internal pulldown */
#  define PORT_PCR_PULLUP           (1 << 0)  /*         Enable internal pullup */
#define PORT_PCR_PE                 (1 << 1)  /* Bit 1:  Pull Enable */
#define PORT_PCR_PFE                (1 << 4)  /* Bit 4:  Passive Filter Enable */
#define PORT_PCR_DSE                (1 << 6)  /* Bit 6:  Drive Strength Enable */
#define PORT_PCR_MUX_SHIFT          (8)       /* Bits 8-10:  Pin Mux Control */
#define PORT_PCR_MUX_MASK           (7 << PORT_PCR_MUX_SHIFT)
#  define PORT_PCR_MUX_DISABLE      (0 << PORT_PCR_MUX_SHIFT) /* Alternative 0: Pin disable/analog */
#  define PORT_PCR_MUX_GPIO         (1 << PORT_PCR_MUX_SHIFT) /* Alternative 1 (GPIO) */
#  define PORT_PCR_MUX_ALT2         (2 << PORT_PCR_MUX_SHIFT) /* Alternative 2 (chip-specific) */
#  define PORT_PCR_MUX_ALT3         (3 << PORT_PCR_MUX_SHIFT) /* Alternative 3 (chip-specific) */
#  define PORT_PCR_MUX_ALT4         (4 << PORT_PCR_MUX_SHIFT) /* Alternative 4 (chip-specific) */
#  define PORT_PCR_MUX_ALT5         (5 << PORT_PCR_MUX_SHIFT) /* Alternative 5 (chip-specific) */
#  define PORT_PCR_MUX_ALT6         (6 << PORT_PCR_MUX_SHIFT) /* Alternative 6 (chip-specific) */
#  define PORT_PCR_MUX_ALT7         (7 << PORT_PCR_MUX_SHIFT) /* Alternative 7 (chip-specific) */
#define PORT_PCR_LK                 (1 << 15) /* Bit 15: Lock Register */
#define PORT_PCR_IRQC_SHIFT         (16)      /* Bits 16-19:  Interrupt Configuration */
#define PORT_PCR_IRQC_MASK          (15 << PORT_PCR_IRQC_SHIFT)
#  define PORT_PCR_IRQC_MASK        (0 << PORT_PCR_IRQC_SHIFT)  /* Interrupt Status Flag (ISF) is disabled */
#  define PORT_PCR_IRQC_DMARISING   (1 << PORT_PCR_IRQC_SHIFT)  /* ISF flag and DMA request on rising edge */
#  define PORT_PCR_IRQC_DMAFALLING  (2 << PORT_PCR_IRQC_SHIFT)  /* ISF flag and DMA request on falling edge */
#  define PORT_PCR_IRQC_DMABOTH     (3 << PORT_PCR_IRQC_SHIFT)  /* ISF flag and DMA request on either edge */
#  define PORT_PCR_IRQC_INTZERO     (8 << PORT_PCR_IRQC_SHIFT)  /* ISF flag and Interrupt when logic 0 */
#  define PORT_PCR_IRQC_INTRISING   (9 << PORT_PCR_IRQC_SHIFT)  /* ISF flag and Interrupt on rising-edge */
#  define PORT_PCR_IRQC_INTFALLING  (10 << PORT_PCR_IRQC_SHIFT) /* ISF flag and Interrupt on falling-edge */
#  define PORT_PCR_IRQC_INTEITHER   (11 << PORT_PCR_IRQC_SHIFT) /* ISF flag and Interrupt on either edge */
#  define PORT_PCR_IRQC_INTONE      (12 << PORT_PCR_IRQC_SHIFT) /* ISF flag and Interrupt when logic 1 */
#define PORT_PCR_ISF                (1 << 24) /* Bit 24: Interrupt Status Flag */

/* Global Pin Control Low Register */

#define PORT_GPCLR_GPWD_SHIFT       (0)       /* Bits 0-15: Global Pin Write Data */
#define PORT_GPCLR_GPWD_MASK        (0xffff << PORT_GPCLR_GPWD_SHIFT)
#  define PORT_GPCLR_GPWD_PIN(n)    ((uint32_t)(n) << PORT_GPCLR_GPWD_SHIFT) /* Pin n=0..15 */
#define PORT_GPCLR_GPWE_SHIFT       (16)      /* Bits 16-31: Global Pin Write Enable */
#define PORT_GPCLR_GPWE_MASK        (0xffff << PORT_GPCLR_GPWE_SHIFT)
#  define PORT_GPCLR_GPWE_PIN(n)    ((uint32_t)(n) << PORT_GPCLR_GPWE_SHIFT) /* Pin n=0..15 */

/* Global Pin Control High Register */

#define PORT_GPCHR_GPWD_SHIFT       (0)       /* Bits 0-15: Global Pin Write Data */
#define PORT_GPCHR_GPWD_MASK        (0xffff << PORT_GPCHR_GPWD_SHIFT)
#  define PORT_GPCHR_GPWD_PIN(n)    ((uint32_t)((n) - 16) << PORT_GPCHR_GPWD_SHIFT) /* Pin n=16..31 */
#define PORT_GPCHR_GPWE_SHIFT       (16)      /* Bits 16-31: Global Pin Write Enable */
#define PORT_GPCHR_GPWE_MASK        (0xffff << PORT_GPCHR_GPWE_SHIFT)
#  define PORT_GPCHR_GPWE_PIN(n)    ((uint32_t)((n) - 16) << PORT_GPCHR_GPWE_SHIFT) /* Pin n=16..31 */

/* Global Interrupt Control Low Register */

#define PORT_GICLR_GIWD_SHIFT       (0)       /* Bits 0-15: Global Interrupt Write Data */
#define PORT_GICLR_GIWD_MASK        (0xffff << PORT_GICLR_GIWD_SHIFT)
#  define PORT_GICLR_GIWD_PIN(n)    ((uint32_t)(n) << PORT_GICLR_GIWD_SHIFT) /* Pin n=0..15 */
#define PORT_GICLR_GIWE_SHIFT       (16)      /* Bits 16-31: Global Interrupt Write Enable */
#define PORT_GICLR_GIWE_MASK        (0xffff << PORT_GICLR_GIWE_SHIFT)
#  define PORT_GICLR_GIWE_PIN(n)    ((uint32_t)(n) << PORT_GICLR_GIWE_SHIFT) /* Pin n=0..15 */

/* Global Interrupt Control High Register */

#define PORT_GICHR_GIWD_SHIFT       (0)       /* Bits 0-15: Global Interrupt Write Data */
#define PORT_GICHR_GIWD_MASK        (0xffff << PORT_GICHR_GIWD_SHIFT)
#  define PORT_GICHR_GIWD_PIN(n)    ((uint32_t)((n) - 16) << PORT_GICHR_GIWD_SHIFT) /* Pin n=16..31 */
#define PORT_GICHR_GIWE_SHIFT       (16)      /* Bits 16-31: Global Interrupt Write Enable */
#define PORT_GICHR_GIWE_MASK        (0xffff << PORT_GICHR_GIWE_SHIFT)
#  define PORT_GICHR_GIWE_PIN(n)    ((uint32_t)((n) - 16) << PORT_GICHR_GIWE_SHIFT) /* Pin n=16..31 */

/* Interrupt Status Flag Register */

#define PORT_ISFR(n)                (1 << (n))  /* Interrupt Status Flag, n=0-31 */

/* Digital Filter Enable Register */

#define PORT_DFER(n)                (1 << (n))  /* Digital Filter Enable, n=0-31 */

/* Digital Filter Clock Register */

#define PORT_DFCR_CS                (1 << 0)  /* Bit 0:  Clock Source */
#  define PORT_DFCR_BUSCLK          (0)       /*         Digital filters clocked by bus clock */
#  define PORT_DFCR_BUSCLK          (1 << 0)  /*         Digital filters clocked by LPO clock */

/* Digital Filter Width Register */

#define PORT_DFWR_FILT_SHIFT        (0)       /* Bits 0-4: Filter Length */
#define PORT_DFWR_FILT_MASK         (31 << PORT_DFWR_FILT_SHIFT)
#  define PORT_DFWR_FILT(n)         ((uint32_t)(n) << PORT_DFWR_FILT_SHIFT)

#endif /* __ARCH_ARM_SRC_S32K1XX_HARDWARE_S32K1XX_PORT_H */
